In [1]:
import pandas as pd
import numpy as np

In [2]:
confirm = pd.read_csv('https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_confirmed_global.csv')
recover = pd.read_csv('https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_recovered_global.csv')
death = pd.read_csv('https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_deaths_global.csv')

In [3]:
confirm.to_csv('confirm.csv')
recover.to_csv('recover.csv')
death.to_csv('death.csv')

In [4]:
confirm.shape

(264, 97)

In [5]:
recover.shape

(250, 97)

In [6]:
death.shape

(264, 97)

In [7]:
confirm.head()

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,4/14/20,4/15/20,4/16/20,4/17/20,4/18/20,4/19/20,4/20/20,4/21/20,4/22/20,4/23/20
0,NaN,Afghanistan,33.0000,65.0000,0,0,0,0,0,0,...,714,784,840,906,933,996,1026,1092,1176,1279
1,NaN,Albania,41.1533,20.1683,0,0,0,0,0,0,...,475,494,518,539,548,562,584,609,634,663
2,NaN,Algeria,28.0339,1.6596,0,0,0,0,0,0,...,2070,2160,2268,2418,2534,2629,2718,2811,2910,3007
3,NaN,Andorra,42.5063,1.5218,0,0,0,0,0,0,...,659,673,673,696,704,713,717,717,723,723
4,NaN,Angola,-11.2027,17.8739,0,0,0,0,0,0,...,19,19,19,19,24,24,24,24,25,25

In [8]:
# confirm.fillna("", inplace=True)
# recover.fillna("", inplace=True)
# death.fillna("", inplace=True)

In [9]:
temp = confirm.iloc[:,:4]
temp['confirm'] = confirm.iloc[:,-1]
confirm = temp

In [10]:
confirm.head()

  Province/State Country/Region      Lat     Long  confirm
0            NaN    Afghanistan  33.0000  65.0000     1279
1            NaN        Albania  41.1533  20.1683      663
2            NaN        Algeria  28.0339   1.6596     3007
3            NaN        Andorra  42.5063   1.5218      723
4            NaN         Angola -11.2027  17.8739       25

In [11]:
temp = recover.iloc[:,:4]
temp['recover'] = recover.iloc[:,-1]
recover = temp

In [12]:
recover.head()

  Province/State Country/Region      Lat     Long  recover
0            NaN    Afghanistan  33.0000  65.0000      179
1            NaN        Albania  41.1533  20.1683      385
2            NaN        Algeria  28.0339   1.6596     1355
3            NaN        Andorra  42.5063   1.5218      333
4            NaN         Angola -11.2027  17.8739        6

In [13]:
temp = death.iloc[:,:4]
temp['death'] = death.iloc[:,-1]
death = temp

In [14]:
death.head()

  Province/State Country/Region      Lat     Long  death
0            NaN    Afghanistan  33.0000  65.0000     42
1            NaN        Albania  41.1533  20.1683     27
2            NaN        Algeria  28.0339   1.6596    407
3            NaN        Andorra  42.5063   1.5218     37
4            NaN         Angola -11.2027  17.8739      2

In [15]:
data = confirm.merge(recover, sort=False, on=['Province/State','Country/Region','Lat','Long'], how='left')

In [16]:
data.shape

(264, 6)

In [17]:
data.head()

  Province/State Country/Region      Lat     Long  confirm  recover
0            NaN    Afghanistan  33.0000  65.0000     1279    179.0
1            NaN        Albania  41.1533  20.1683      663    385.0
2            NaN        Algeria  28.0339   1.6596     3007   1355.0
3            NaN        Andorra  42.5063   1.5218      723    333.0
4            NaN         Angola -11.2027  17.8739       25      6.0

In [18]:
data = data.merge(death, sort=False, on=['Province/State','Country/Region','Lat','Long'], how='left')

In [19]:
data.shape

(264, 7)

In [20]:
data.head()

  Province/State Country/Region      Lat     Long  confirm  recover  death
0            NaN    Afghanistan  33.0000  65.0000     1279    179.0     42
1            NaN        Albania  41.1533  20.1683      663    385.0     27
2            NaN        Algeria  28.0339   1.6596     3007   1355.0    407
3            NaN        Andorra  42.5063   1.5218      723    333.0     37
4            NaN         Angola -11.2027  17.8739       25      6.0      2

In [21]:
data.isna().sum()

Province/State    182
Country/Region      0
Lat                 0
Long                0
confirm             0
recover            28
death               0
dtype: int64

In [22]:
data['recover'].fillna(0, inplace=True)

In [23]:
data['Province/State'].fillna('', inplace=True)

In [24]:
data['recover']=data['recover'].astype('int')

In [25]:
data.isna().sum()

Province/State    0
Country/Region    0
Lat               0
Long              0
confirm           0
recover           0
death             0
dtype: int64

In [26]:
data.columns = ['state','country','lat','long','confirm','recover','death']

In [27]:
data.head()

  state      country      lat     long  confirm  recover  death
0        Afghanistan  33.0000  65.0000     1279      179     42
1            Albania  41.1533  20.1683      663      385     27
2            Algeria  28.0339   1.6596     3007     1355    407
3            Andorra  42.5063   1.5218      723      333     37
4             Angola -11.2027  17.8739       25        6      2

In [28]:
data.to_json('../frontend/src/assets/data/data.json', orient='records' )